brianwyld/ble_nrf52_v2/src/main.c
/*
 * Copyright (c) 2016 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is confidential property of Nordic Semiconductor. The use,
 * copying, transfer or disclosure of such information is prohibited except by express written
 * agreement with Nordic Semiconductor.
 *
 */

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include "main.h"
#include "nordic_common.h"
#include "nrf.h"
#include "ble_conn_params.h"
#include "app_timer.h"
#include "app_error.h"
#include "app_uart.h"
#include "app_button.h"
#include "ble_db_discovery.h"
#include "app_util.h"
#include "app_util_platform.h"
#include "bsp.h"
#include "bsp_btn_ble.h"
#include "boards.h"
#include "bsp_config.h"
#include "ble.h"
#include "ble_gap.h"
#include "ble_nus.h"
#include "ble_hci.h"
#include "ble_gatts.h"
#include "softdevice_handler.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "nrf_delay.h"

#include "timer_watchdog.h"

#include "bsp_minew_nrf51.h"
#include "configmgr.h"
#include "comm_uart.h"

#include "ibs_scan.h"

#ifndef FW_MAJOR
#define FW_MAJOR (2)
#endif
#ifndef FW_MINOR 
#define FW_MINOR (0)
#endif
#define IS_SRVC_CHANGED_CHARACT_PRESENT 0   /**< Include the service_changed characteristic. If not enabled, the server's database cannot be changed for the lifetime of the device. */

#define CENTRAL_LINK_COUNT              1   /**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT           1   /**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#if (NRF_SD_BLE_API_VERSION == 3)
#define NRF_BLE_MAX_MTU_SIZE    GATT_MTU_SIZE_DEFAULT           /**< MTU size used in the softdevice enabling and to reply to a BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST event. */
#endif

#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2        /**< Reply when unsupported features are requested. */
 
#define DEVICE_NAME_BASE             "w"                                       /**< Name of device when for connection beacons. Will be included in the advertising data. */
#define DEVICE_NAME_LEN             16      // w_0000_0000

#define NUS_SERVICE_UUID_TYPE           BLE_UUID_TYPE_VENDOR_BEGIN                  /**< UUID type for the Nordic UART Service (vendor specific). */
 
#define APP_ADV_INTERVAL_SLOW           64                                          /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS       180                                         /**< The advertising timeout (in units of seconds). */
 
#define APP_TIMER_PRESCALER             0                                           /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE_UART    4                                           /**< Size of timer operation queues. */
#define APP_TIMER_OP_QUEUE_SIZE_WB      2                                           /**< Size of timer operation queues. */
 
 
#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(20, UNIT_1_25_MS)             /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(75, UNIT_1_25_MS)             /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)  /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER) /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */
 
#define DEAD_BEEF 0xDEADBEEF                                    /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define NUS_SERVICE_UUID_TYPE   BLE_UUID_TYPE_VENDOR_BEGIN      /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_TIMER_PRESCALER     0                               /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE 2                               /**< Size of timer operation queues. */

#define MIN_CONNECTION_INTERVAL MSEC_TO_UNITS(20, UNIT_1_25_MS) /**< Determines minimum connection interval in millisecond. */
#define MAX_CONNECTION_INTERVAL MSEC_TO_UNITS(75, UNIT_1_25_MS) /**< Determines maximum connection interval in millisecond. */
#define SLAVE_LATENCY           0                               /**< Determines slave latency in counts of connection events. */
#define SUPERVISION_TIMEOUT     MSEC_TO_UNITS(4000, UNIT_10_MS) /**< Determines supervision time-out in units of 10 millisecond. */

#define PRINT_DEBUG 0
 
//WBeacon
#define APP_BEACON_INFO_LENGTH          0x17                                    /**< Total length of information advertised by the Beacon. */
#define MAJ_VAL_OFFSET_IN_BEACON_INFO   18                                      /**< Position of the MSB of the Major Value in m_beacon_info array. */
#define APP_CFG_NON_CONN_ADV_TIMEOUT    0                                   /**< Time for which the device must be advertising in non-connectable mode (in seconds). 0 disables timeout. */

static struct app_context {
    //UART Variables
    uint16_t                m_conn_handle;    /**< Handle of the current GAP connection. */
    ble_uuid_t              m_adv_uuids[2];  /**< Universally unique service identifier. */
    ble_db_discovery_t      m_ble_db_discovery;             /**< Instance of database discovery module. Must be passed to all db_discovert API calls */
    // config
    bool bleConnectable;        // is it allowed to connect via GAP for config or uart pass-thru?
    bool isIBeaconning;         // should we be acting as ibeacon just now?
    //iBeacon config
    uint16_t advertisingInterval_ms; // Default advertising interval 100 ms
    int8_t txPowerLevel; // Default -4dBm
    uint16_t major_value;
    uint16_t minor_value;
    uint8_t beacon_uuid_tab[UUID128_SIZE];
    uint16_t company_id; // apple 0x0059 -> Nordic
    uint8_t measured_rssi;
    uint8_t device_type;        // for ibeacon?
    // config for connectable adverts
    char nameAdv[DEVICE_NAME_LEN];
    bool IsNameCustom;
    bool isPasswordOK;              // Indicates if password has been validated or not
    uint8_t passwordTab[PASSWORD_LEN]; // Password
    uint8_t masterPasswordTab[PASSWORD_LEN]; // Password
    uint8_t adv_data_length;
    ble_gap_adv_params_t m_adv_params;                                 /**< Parameters to be passed to the stack when starting advertising. */
    uint8_t m_beacon_info[APP_BEACON_INFO_LENGTH]; 
    bool flashWriteReq;
    bool flashBusy;
    bool resetRequested;
} _ctx = {
    .m_conn_handle = BLE_CONN_HANDLE_INVALID, 
    .m_adv_uuids = {{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}},
    .bleConnectable=true,
    .isIBeaconning=false,
    .advertisingInterval_ms = 300, 
    .txPowerLevel = RADIO_TXPOWER_TXPOWER_Neg20dBm,  
    .major_value = 0xFFFF,
    .minor_value = 0xFFFF,
    .beacon_uuid_tab = {0xE2, 0xC5, 0x6D, 0xB5, 0xDF, 0xFB, 0x48, 0xD2, 0xB0, 0x60, 0xD0, 0xF5, 0xA7, 0x10, 0x96, 0xE0},
    .nameAdv = "W_FFFF_FFFF", 
    .adv_data_length = 0x15,
    .company_id = 0x004C, 
    .measured_rssi = 0xC3,
    .device_type = 0x02,
    .passwordTab = {'0', '0', '0', '0'},
    .masterPasswordTab = {'6', '0', '6', '7'},
};

static void sys_evt_handler(uint32_t evt);
static uint32_t advertising_check_start();

