brianwyld/ble_nrf52_v2/src/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}
*/

static uint32_t advertising_check_start()
{
    // in all cases, setup to be ready
    ble_gap_conn_sec_mode_t sec_mode;    
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    // password check has not been validated
    SetActivePassword(false);
    // Update name in case major/minor changed 
    sprintf(_ctx.nameAdv, "%s_%04x_%04x", DEVICE_NAME_BASE, _ctx.major_value, _ctx.minor_value);
    // Change name
    sd_ble_gap_device_name_set(&sec_mode,
                               (const uint8_t *)(&_ctx.nameAdv[0]),
                                strlen(_ctx.nameAdv));
 
    // Change tx power level
    sd_ble_gap_tx_power_set(GetTXPOWER_Level());
 
    advertising_init();
    conn_params_init();
    // only advertise if we want to be connectable, or we are ibeaconning, and we are NOT scanning
    if ((_ctx.bleConnectable || _ctx.isIBeaconning) && ibs_is_scan_active()==false)
    {
        return ble_advertising_start(_ctx.isIBeaconning?BLE_ADV_MODE_FAST:BLE_ADV_EVT_SLOW);
    }
    // TODO is it neccessary to stop advertising or did the init() do it?

    return 0;       // setup ok
}
 
void sys_evt_handler(uint32_t evt)
{
    switch(evt)
    {
        case NRF_EVT_FLASH_OPERATION_SUCCESS:
            _ctx.flashBusy = false;
        break;
        
        case NRF_EVT_FLASH_OPERATION_ERROR:
            _ctx.flashBusy = false;         // Still finished though
        break;
        
        default:
        break;
    }
}




 

static void deinit_uart_timeout_handler(void * p_context)
{
    comm_uart_deinit();
    
    //
    //examples to setup TX/RX in different mode :
    //
    //nrf_gpio_cfg_default(RX_PIN_NUMBER);
    //nrf_gpio_cfg_default(TX_PIN_NUMBER);
    //
    //nrf_gpio_cfg_output(RX_PIN_NUMBER);
    //nrf_gpio_pin_set(RX_PIN_NUMBER);
    //nrf_gpio_cfg_output(TX_PIN_NUMBER);
    //nrf_gpio_pin_set(TX_PIN_NUMBER);
    //
    //nrf_gpio_cfg_input(RX_PIN_NUMBER, GPIO_PIN_CNF_PULL_Pulldown);
    //nrf_gpio_cfg_input(TX_PIN_NUMBER, GPIO_PIN_CNF_PULL_Pulldown);
}

void system_init(void)
{
    uint32_t err_code;
            
    softdevice_sys_evt_handler_set(sys_evt_handler);
        
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);
    
    db_discovery_init();

    log_uart_init();
    ble_stack_init();

    comm_uart_init(); // REV B invert TX RX for board//
    comm_uart_tx("READY\r\n",7, NULL);
    
    gap_params_init();
    services_init();
    // Init adv parameters and start if required
    err_code = advertising_check_start();
    APP_ERROR_CHECK(err_code);

    //todo remove uart disabled at 10s of ibeaconning for power
    /*                    
    app_timer_create(&m_deinit_uart_delay,
                        APP_TIMER_MODE_SINGLE_SHOT,
                        deinit_uart_timeout_handler);    
        uint32_t deinit_delay = APP_TIMER_TICKS(10000, APP_TIMER_PRESCALER);//32 * 10000;          
        app_timer_start(m_deinit_uart_delay, deinit_delay, NULL);
    */
}
int main(void)
{
    ConfigInit();              
    
    system_init();
    for (;;)
    {        
        if (_ctx.resetRequested)
        {
            NVIC_SystemReset();
        }
        if(_ctx.flashWriteReq)
        {
            ConfigWrite();
            _ctx.flashWriteReq = false;
        }
        
        // Go in lowpower only if flash isn't busy
        if(!_ctx.flashBusy)
        {
            power_manage();
        }
    }
}
